#+title: Use fio to simulate ~irmin-pack.unix~ load

* Read performance
** Baseline ~irmin-pack.unix~ reads

We attempt to simulate a similar behaviour as is currently implemented by ~irmin-pack.unix~.

From observations we have that:

- During the processing of a single Tezos Block about 3.5 MiB is read from disk
- Average access size is between 50-100 bytes
- ~irmin-pack.unix~ uses the `pread` system calls from a single thread

#+begin_src ini :tangle baseline-reads.ini
[global]
rw=randread
filename=/home/adatario/dev/tclpa/.git/annex/objects/gx/17/SHA256E-s3691765475--13300581f2404cc24774da8615a5a3d3f0adb7d68c4c8034c4fa69e727706000/SHA256E-s3691765475--13300581f2404cc24774da8615a5a3d3f0adb7d68c4c8034c4fa69e727706000

[job1]
ioengine=psync
rw=randread
blocksize_range=50-300
size=3500000B
loops=100
#+end_src

#+begin_src shell :exports both
  fio baseline-reads.ini
#+end_src

#+RESULTS:
| job1:    | (g=0):         | rw=randread,        | bs=(R)                       | 50B-300B,            | (W)               | 50B-300B,          | (T)                 | 50B-300B,          | ioengine=psync,     | iodepth=1       |
| fio-3.33 |                |                     |                              |                      |                   |                    |                     |                    |                     |                 |
| Starting | 1              | process             |                              |                      |                   |                    |                     |                    |                     |                 |
|          |                |                     |                              |                      |                   |                    |                     |                    |                     |                 |
| job1:    | (groupid=0,    | jobs=1):            | err=                         | 0:                   | pid=149111:       | Wed                | May                 | 17                 | 14:06:39            | 2023            |
| read:    | IOPS=198k,     | BW=25.6MiB/s        | (26.9MB/s)(334MiB/13021msec) |                      |                   |                    |                     |                    |                     |                 |
| clat     | (nsec):        | min=210,            | max=3657.9k,                 | avg=4815.80,         | stdev=25769.18    |                    |                     |                    |                     |                 |
| lat      | (nsec):        | min=231,            | max=3658.7k,                 | avg=4842.05,         | stdev=25779.04    |                    |                     |                    |                     |                 |
| clat     | percentiles    | (nsec):             |                              |                      |                   |                    |                     |                    |                     |                 |
|          |                | 1.00th=[            | 231],                        | 5.00th=[             | 231],             | 10.00th=[          | 241],               | 20.00th=[          | 241],               |                 |
|          |                | 30.00th=[           | 262],                        | 40.00th=[            | 330],             | 50.00th=[          | 342],               | 60.00th=[          | 342],               |                 |
|          |                | 70.00th=[           | 350],                        | 80.00th=[            | 410],             | 90.00th=[          | 462],               | 95.00th=[          | 916],               |                 |
|          |                | 99.00th=[138240],   | 99.50th=[156672],            | 99.90th=[232448],    | 99.95th=[252928], |                    |                     |                    |                     |                 |
|          |                | 99.99th=[501760]    |                              |                      |                   |                    |                     |                    |                     |                 |
| bw       | (              | KiB/s):             | min=20596,                   | max=33922,           | per=99.42%,       | avg=26097.96,      | stdev=4758.15,      | samples=26         |                     |                 |
| iops     | :              | min=155040,         | max=255966,                  | avg=196555.85,       | stdev=36116.13,   | samples=26         |                     |                    |                     |                 |
| lat      | (nsec)         | :                   | 250=20.56%,                  | 500=70.61%,          | 750=2.96%,        | 1000=1.15%         |                     |                    |                     |                 |
| lat      | (usec)         | :                   | 2=1.16%,                     | 4=0.19%,             | 10=0.08%,         | 20=0.01%,          | 50=0.01%            |                    |                     |                 |
| lat      | (usec)         | :                   | 100=0.06%,                   | 250=3.16%,           | 500=0.05%,        | 750=0.01%,         | 1000=0.01%          |                    |                     |                 |
| lat      | (msec)         | :                   | 2=0.01%,                     | 4=0.01%              |                   |                    |                     |                    |                     |                 |
| cpu      | :              | usr=7.05%,          | sys=10.31%,                  | ctx=84444,           | majf=0,           | minf=13            |                     |                    |                     |                 |
| IO       | depths         | :                   | 1=100.0%,                    | 2=0.0%,              | 4=0.0%,           | 8=0.0%,            | 16=0.0%,            | 32=0.0%,           | >=64=0.0%           |                 |
| submit   | :              | 0=0.0%,             | 4=100.0%,                    | 8=0.0%,              | 16=0.0%,          | 32=0.0%,           | 64=0.0%,            | >=64=0.0%          |                     |                 |
| complete | :              | 0=0.0%,             | 4=100.0%,                    | 8=0.0%,              | 16=0.0%,          | 32=0.0%,           | 64=0.0%,            | >=64=0.0%          |                     |                 |
| issued   | rwts:          | total=2575300,0,0,0 | short=0,0,0,0                | dropped=0,0,0,0      |                   |                    |                     |                    |                     |                 |
| latency  | :              | target=0,           | window=0,                    | percentile=100.00%,  | depth=1           |                    |                     |                    |                     |                 |
|          |                |                     |                              |                      |                   |                    |                     |                    |                     |                 |
| Run      | status         | group               | 0                            | (all                 | jobs):            |                    |                     |                    |                     |                 |
| READ:    | bw=25.6MiB/s   | (26.9MB/s),         | 25.6MiB/s-25.6MiB/s          | (26.9MB/s-26.9MB/s), | io=334MiB         | (350MB),           | run=13021-13021msec |                    |                     |                 |
|          |                |                     |                              |                      |                   |                    |                     |                    |                     |                 |
| Disk     | stats          | (read/write):       |                              |                      |                   |                    |                     |                    |                     |                 |
| dm-1:    | ios=83721/148, | merge=0/0,          | ticks=10708/0,               | in_queue=10708,      | util=94.38%,      | aggrios=84400/148, | aggrmerge=0/0,      | aggrticks=10732/0, | aggrin_queue=10732, | aggrutil=94.28% |
| dm-0:    | ios=84400/148, | merge=0/0,          | ticks=10732/0,               | in_queue=10732,      | util=94.28%,      | aggrios=84400/132, | aggrmerge=0/16,     | aggrticks=9138/5,  | aggrin_queue=9144,  | aggrutil=94.28% |
| nvme0n1: | ios=84400/132, | merge=0/16,         | ticks=9138/5,                | in_queue=9144,       | util=94.28%       |                    |                     |                    |                     |                 |

A read bandwidth of about 25MiB/s. This seems to match up with the read performance observed when replaying a Tezos trace.

** Multiple Threads

Simulate multiple threads doing IO reads.

| Number of Threads | Read bandwidth (MiB/s) |
|-------------------+------------------------|
|                 1 |                   23.4 |
|                 2 |                   72.8 |
|                 3 |                    102 |
|                 4 |                    127 |
|                 5 |                    147 |
|                 6 |                    163 |
|                 7 |                    175 |
|                 8 |                    167 |
|                 9 |                    175 |
|                10 |                    172 |

TODO: write a script that does this automatically. For some reason I can't get division working in the fio job description file (https://fio.readthedocs.io/en/latest/fio_doc.html#job-file-parameters).

#+begin_src ini :tangle multiple-threads-pread.ini
[global]
rw=randread
filename=/home/adatario/dev/tclpa/.git/annex/objects/gx/17/SHA256E-s3691765475--13300581f2404cc24774da8615a5a3d3f0adb7d68c4c8034c4fa69e727706000/SHA256E-s3691765475--13300581f2404cc24774da8615a5a3d3f0adb7d68c4c8034c4fa69e727706000
loops=100
group_reporting
thread

[job1]
ioengine=psync
rw=randread
blocksize_range=50-300
size=350000
numjobs=10
#+end_src

#+begin_src shell :exports both
  fio multiple-threads-pread.ini
#+end_src

